app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating = 'G','R','PG-13','PG') ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13') AND "movies"."order" = 'release_date'
---
  def index

    @all_ratings = Movie.ratings # ['G','PG','PG-13','R']

    if params[:sort].nil? and session[:sort].nil?
      @sort = "title"
    elsif params[:sort].nil?
      @sort = session[:sort]
    else
      @sort = params[:sort]
      session[:sort] = params[:sort]
    end

    if params[:ratings].nil? and session[:ratings].nil?
      @movies = Movie.all(:order => @sort)
    elsif params[:ratings].nil?
      @movies = Movie.where(:rating => session[:ratings].keys).order(@sort)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'PG-13', "release_date" = '2013-05-04 00:00:00.000000', "updated_at" = '2013-02-03 18:50:39.817337' WHERE "movies"."id" = 17
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])